Messwerte/Archiv/Raw/apache_benchmark_repeat35/default/runnc/go-httpd/target_count_21/repeat_2/15.txt
2020/01/30 14:35:08 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8015/
2020/01/30 14:35:38 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Finished 45486 requests
Server Software:        
Server Hostname:        192.168.3.100
Server Port:            8015
Document Path:          /
Document Length:        26 bytes
Concurrency Level:      100
Time taken for tests:   30.022 seconds
Complete requests:      45486
Failed requests:        0
Total transferred:      6504498 bytes
HTML transferred:       1182636 bytes
Requests per second:    1515.08 [#/sec] (mean)
Time per request:       66.003 [ms] (mean)
Time per request:       0.660 [ms] (mean, across all concurrent requests)
Transfer rate:          211.58 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   28 107.5     12    3073
Processing:     1   37  98.7     24    3005
Waiting:        1   37  98.5     24    3005
Total:          1   66 152.4     37    4052
Percentage of the requests served within a certain time (ms)
  50%     37
  66%     50
  75%     59
  80%     63
  90%    126
  95%    208
  98%    318
  99%   1025
 100%   4052 (longest request)
{"connect":{"max":3073,"mean":28,"median":12,"min":0,"stdDev":107.5},"percentiles":{"100":4052,"50":37,"66":50,"75":59,"80":63,"90":126,"95":208,"98":318,"99":1025},"processing":{"max":3005,"mean":37,"median":24,"min":1,"stdDev":98.69999694824219},"total":{"max":4052,"mean":66,"median":37,"min":1,"stdDev":152.39999389648438},"waiting":{"max":3005,"mean":37,"median":24,"min":1,"stdDev":98.5}}
2020/01/30 14:35:38 Matched stat line [Connect:        0   28 107.5     12    3073 Connect 0 28 107.5 12 3073]
2020/01/30 14:35:38 Matched stat line [Processing:     1   37  98.7     24    3005 Processing 1 37 98.7 24 3005]
2020/01/30 14:35:38 Matched stat line [Waiting:        1   37  98.5     24    3005 Waiting 1 37 98.5 24 3005]
2020/01/30 14:35:38 Matched stat line [Total:          1   66 152.4     37    4052 Total 1 66 152.4 37 4052]
2020/01/30 14:35:38 Matched percentline [  50%     37 50 37]
2020/01/30 14:35:38 Matched percentline [  66%     50 66 50]
2020/01/30 14:35:38 Matched percentline [  75%     59 75 59]
2020/01/30 14:35:38 Matched percentline [  80%     63 80 63]
2020/01/30 14:35:38 Matched percentline [  90%    126 90 126]
2020/01/30 14:35:38 Matched percentline [  95%    208 95 208]
2020/01/30 14:35:38 Matched percentline [  98%    318 98 318]
2020/01/30 14:35:38 Matched percentline [  99%   1025 99 1025]
2020/01/30 14:35:38 Matched percentline [ 100%   4052 100 4052]